** Acciones de IO como valores
No todas las acciones de IO se deben ejecutar cuando son creadas. La habilidad de mencionar una acción
sin ser ejecutada permite que las funciones ordinarias sirvan de estructuras de control.

Por ejemplo, la función ~twice~ toma una acción IO como argumento y regresa una acción que ejecuta
la acción del argumento dos veces

#+begin_src lean4 :results output :session actions
  def twice (action : IO Unit) : IO Unit := do
    action
    action 

  #eval twice (IO.println "Hola")
#+end_src

#+RESULTS:
: Hola
: Hola


Esto se puede generalizar de la siguiente manera

#+begin_src lean4 :results output :session actions 
  def nTimes (action : IO Unit) : Nat → IO Unit 
    | 0 => pure ()
    | n + 1 => do
      action
      nTimes action n
  #eval nTimes (IO.println "Hola") 5
#+end_src

#+RESULTS:
: Hola
: Hola
: Hola
: Hola
: Hola


En el caso base para ~Nat.zero~, el resultado es ~pure ()~. La función ~pure~ crea una acción IO que no
tiene efectos secundarios, pero regresa su argumento, que en este caso es el constructor para ~Unit~.
En el paso recursivo se usa un bloque *do* para crear una acción que primero ejecuta la acción y luego
ejecuta el resultado de la llamada recursiva.

El hecho de que las acciones de IO sean valores de primera clase significa que se pueden guardar en
estructuras de datos para ejecución futura. Por ejemplo, la función ~countdown~ toma un ~Nat~ y regresa una
lista de acciones IO sin ejecutar

#+begin_src lean4 :results output :session actions 
  def countdown : Nat → List (IO Unit)
    | 0 => [IO.println "Blast off!"]
    | n + 1 => IO.println s!"{n + 1}" :: countdown n
#+end_src

#+RESULTS:


Esta función no tiene efectos secundarios y no imprime nada. Por ejemplo, se puede aplicar a un argumento
para obtener un a lista de acciones

#+begin_src lean4 :results output :session actions 
def from5 : List (IO Unit) := countdown 5
#+end_src

#+RESULTS:


Esta lista contiene 6 elementos (uno para cada elemento y una acción "Blast off!" para cero):

#+begin_src lean4 :results output :session actions 
#eval from5.length
#+end_src

#+RESULTS:
: 6


La función ~runActions~ toma una lista de acciones y construye una sola acción que las ejecuta todas

#+begin_src lean4 :results output :session actions 
  def runActions : List (IO Unit) → IO Unit
    | [] => pure ()
    | act :: actions => do
      act
      runActions actions

  #eval runActions from5
#+end_src

#+RESULTS:
: 5
: 4
: 3
: 2
: 1
: Blast off!

** Main
El último paso es escribir la acción main. En este caso, main es una función. En Lean,
main puede tener uno de tres tipos
- ~main : IO Unit~ corresponde a programas que no leen sus argumentos y siempre indican éxito
  con código 0.
- ~main : IO UInt32~ corresponde a programas que no leen sus argumentos y regresan códigos de
   error
- ~main : List String → IO UInt32~ corresponde a programas que leen sus argumentos y regresan
  códigos de error

Si no se da ningún argumento, feline debería leer de standard input.

#+begin_src lean4 :tangle feline/Main.lean 
  def main (args : List String) : IO UInt32 :=
    match args with
      | [] => process 0 ["-"]
      | _ => process 0 args
#+end_src

Para verificar que feline funciona, primero hay que construirlo con ~lake build~.

#+begin_src shell :results output  
  cd feline
  lake build  
#+end_src

#+RESULTS:
: ✔ [2/4] Built Main (211ms)
: Build completed successfully (4 jobs).

Ahora lo podemos probar con standard input

#+begin_src shell :results output
  cd feline
  echo "It works!" | lake exe feline
#+end_src

#+RESULTS:
: It works!

Ahora lo podemos probar con dos archivos

#+begin_src txt :tangle feline/test1.txt
  It's time to find a warm spot
#+end_src

#+begin_src txt :tangle feline/test2.txt 
  and curl up!
#+end_src

Luego lo probamos

#+begin_src shell :results output 
  cd feline
  lake exe feline test1.txt test2.txt
#+end_src

#+RESULTS:
: It's time to find a warm spot
: and curl up!

Finalmente, el argumento "-" debe tratarse apropiadamente
#+begin_src shell :results output 
  cd feline
  echo "and purr" | lake exe feline test1.txt - test2.txt
#+end_src

#+RESULTS:
: It's time to find a warm spot
: and purr
: and curl up!
